In [1]:
import numpy as np
import pandas as pd

SERIES

In [3]:
etiquetas = ['a', 'b', 'c']
datos = [1,2,3]
pd.Series(data= datos, index = etiquetas)

a    1
b    2
c    3
dtype: int64

In [5]:
#Tb podemos construirlo a partir de un array
array = np.arange(0,3)
pd.Series(array)

0    0
1    1
2    2
dtype: int32

In [8]:
array2 = np.random.randint(1,8,3)
pd.Series(array2)

0    1
1    5
2    4
dtype: int32

In [9]:
array = np.arange(5,8)
etiquetas = ['venta1', 'venta2', 'venta3']
pd.Series(array, etiquetas)

venta1    5
venta2    6
venta3    7
dtype: int32

In [10]:
# Si queremos acceder a los elementos:
array = np.arange(5,8)
etiquetas = ['venta1', 'venta2', 'venta3']
serie1 = pd.Series(array, etiquetas)

In [11]:
#Accedemos por etiqueta
serie1['venta1']

5

In [18]:
# Accedemos por posición
serie1[2]

C:\Users\34649\AppData\Local\Temp\ipykernel_11144\2555371152.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  serie1[2]

7

In [19]:
valor = serie1.iloc[2]
valor

7

In [20]:
#Podemos crear series con datos de diferentes tipos
datos2 =['informatica', 300, 'impresora', 400]
pd.Series(datos2)

0    informatica
1            300
2      impresora
3            400
dtype: object

In [24]:
#Podemos realizar operaciones matemáticas sobre series
serie2 = pd.Series([1,2,3], ['venta1', 'venta2', 'venta3'])
serie3 = pd.Series([4,8,5], ['venta1', 'venta2', 'venta3'])
serie_suma = serie2+serie3
serie_suma

venta1     5
venta2    10
venta3     8
dtype: int64

In [25]:
# Aunque tengan distintas dimensiones podemos realiar operaciones sobre ellas, y nos devuelve nulos en elos elementos 'sobrantes'
serie2 = pd.Series([1,2,3,4], ['venta1', 'venta2', 'venta3', 'venta4'])
serie3 = pd.Series([4,8,5], ['venta1', 'venta2', 'venta3'])
serie_resta = serie3-serie2
serie_resta

venta1    3.0
venta2    6.0
venta3    2.0
venta4    NaN
dtype: float64

DATAFRAMES

In [2]:
import numpy as np
import pandas as pd

In [4]:
filas = ['ventas1', 'ventas2', 'ventas3']
columnas = ['zonaA', 'zonaB', 'zonaC']
datos = [[123,421,256], [234, 541, 257], [120, 451, 258]]

In [6]:
dataframe = pd.DataFrame(datos, filas, columnas)

In [7]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257
ventas3    120    451    258

In [8]:
# Si queremos seleccionar una fila (en este caso la primera)
dataframe.loc['ventas1']

zonaA    123
zonaB    421
zonaC    256
Name: ventas1, dtype: int64

In [9]:
# Si queremos más de una fila:
dataframe.loc[['ventas1', 'ventas2']]

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257

In [10]:
# Si queremos seleccionar una columna
dataframe['zonaA']

ventas1    123
ventas2    234
ventas3    120
Name: zonaA, dtype: int64

In [11]:
# Para ver más de 1 columna:
dataframe [['zonaA', 'zonaC']]

         zonaA  zonaC
ventas1    123    256
ventas2    234    257
ventas3    120    258

In [12]:
# Para seleccionar un valor concreto, por ejemplo 123
dataframe.loc['ventas1']['zonaA']

123

In [13]:
# Creamos una nueva columna donde se sumen todas las zonas
dataframe['TodasLasZonas'] = dataframe['zonaA'] + dataframe['zonaB'] + dataframe['zonaC']
dataframe

         zonaA  zonaB  zonaC  TodasLasZonas
ventas1    123    421    256            800
ventas2    234    541    257           1032
ventas3    120    451    258            829

In [14]:
# Si queremos borrar esa columna: (axis =1 significa quee s una columna)
dataframe.drop('TodasLasZonas', axis=1)

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257
ventas3    120    451    258

In [15]:
#Si volvemos a visualiar el dataframe venos que no se ha borrado definitivamente, solo en esa visulaización:
dataframe

         zonaA  zonaB  zonaC  TodasLasZonas
ventas1    123    421    256            800
ventas2    234    541    257           1032
ventas3    120    451    258            829

In [16]:
#Para borrarlo definitivamente:
dataframe.drop('TodasLasZonas', axis=1, inplace=True)

In [17]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257
ventas3    120    451    258

In [18]:
#Para borrar una fila: (por defecto tenemos el eje x, asi que en este caso no seria necesario poner axis. En el caso de querer ponerlo pondríamos axis=0)
dataframe.drop('ventas1')
# dataframe.drop('ventas1', axis=0)

         zonaA  zonaB  zonaC
ventas2    234    541    257
ventas3    120    451    258

In [19]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257
ventas3    120    451    258

In [20]:
#Como vemos, lo borra solo de forma "temporal". Para que lo borre definitivamente:
dataframe.drop('ventas1', inplace=True)

In [21]:
dataframe

         zonaA  zonaB  zonaC
ventas2    234    541    257
ventas3    120    451    258

In [23]:
#Para ver el tamaño:
dataframe.shape

(2, 3)

DATAFRAME: SELECCIONAR DATOS CON 1 CONDICIÓN

In [1]:
import numpy as np
import pandas as pd

In [4]:
#Creamos un dataframe. mediante el método split creamos una lista de valores
filas = 'ventas1 ventas2 ventas3'.split()
filas

['ventas1', 'ventas2', 'ventas3']

In [5]:
columnas = 'zonaA zonaB zonaC'.split()

In [6]:
columnas

['zonaA', 'zonaB', 'zonaC']

In [7]:
datos = [[120,240,350], [210, 450, 250], [310, 210, 140]]
datos

[[120, 240, 350], [210, 450, 250], [310, 210, 140]]

In [9]:
dataframe2 = pd.DataFrame(datos, filas, columnas)

In [10]:
dataframe2

         zonaA  zonaB  zonaC
ventas1    120    240    350
ventas2    210    450    250
ventas3    310    210    140

In [11]:
# Seleccionamos aquellos valores de la tabla que sean mayores a un valor
condicion = dataframe2 >200
dataframe2[condicion]

         zonaA  zonaB  zonaC
ventas1    NaN    240  350.0
ventas2  210.0    450  250.0
ventas3  310.0    210    NaN

In [12]:
# Podemos seleccionar por condición dentro de 1 columna
condicion = dataframe2['zonaA']>200
dataframe2[condicion]

         zonaA  zonaB  zonaC
ventas2    210    450    250
ventas3    310    210    140

In [13]:
#Podemos anidar cocndiciones
condicion = (dataframe2['zonaA']>200) & (dataframe2['zonaB']>300)
dataframe2[condicion]

         zonaA  zonaB  zonaC
ventas2    210    450    250

In [14]:
condicion = (dataframe2['zonaA']>200) | (dataframe2['zonaB']>300)
dataframe2[condicion]

         zonaA  zonaB  zonaC
ventas2    210    450    250
ventas3    310    210    140

In [15]:
# Si queremos ver solo 1 columna con esa condición
condicion = (dataframe2['zonaA']>200) | (dataframe2['zonaB']>300)
dataframe2[condicion]['zonaA']

ventas2    210
ventas3    310
Name: zonaA, dtype: int64

In [18]:
dataframe2[condicion][['zonaA', 'zonaC']]

         zonaA  zonaC
ventas2    210    250
ventas3    310    140

MODIFICACIÓN DE LOS NOMBRES DE LAS FILAS

In [19]:
dataframe2

         zonaA  zonaB  zonaC
ventas1    120    240    350
ventas2    210    450    250
ventas3    310    210    140

In [22]:
nuevas_filas = 'dia1 dia2 dia3'.split()
nuevas_filas

['dia1', 'dia2', 'dia3']

In [23]:
dataframe2['dias'] = nuevas_filas

In [24]:
dataframe2

         zonaA  zonaB  zonaC  dias
ventas1    120    240    350  dia1
ventas2    210    450    250  dia2
ventas3    310    210    140  dia3

In [25]:
#Cambiamos la fila de días por la de ventas
dataframe2.set_index('dias')

      zonaA  zonaB  zonaC
dias
dia1    120    240    350
dia2    210    450    250
dia3    310    210    140

In [29]:
# Para que lo guarde
dataframe2 = dataframe2.set_index('dias')

In [30]:
dataframe2

      zonaA  zonaB  zonaC
dias
dia1    120    240    350
dia2    210    450    250
dia3    310    210    140